HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxSbcu_bf.h
/** \\brief  Length for Ifx_SBCU_DBCNTL_Bits.ONBOS2 */
#define IFX_SBCU_DBCNTL_ONBOS2_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBCNTL_Bits.ONBOS2 */
#define IFX_SBCU_DBCNTL_ONBOS2_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBCNTL_Bits.ONBOS2 */
#define IFX_SBCU_DBCNTL_ONBOS2_OFF (30)

/** \\brief  Length for Ifx_SBCU_DBCNTL_Bits.ONBOS3 */
#define IFX_SBCU_DBCNTL_ONBOS3_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBCNTL_Bits.ONBOS3 */
#define IFX_SBCU_DBCNTL_ONBOS3_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBCNTL_Bits.ONBOS3 */
#define IFX_SBCU_DBCNTL_ONBOS3_OFF (31)

/** \\brief  Length for Ifx_SBCU_DBCNTL_Bits.ONG */
#define IFX_SBCU_DBCNTL_ONG_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBCNTL_Bits.ONG */
#define IFX_SBCU_DBCNTL_ONG_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBCNTL_Bits.ONG */
#define IFX_SBCU_DBCNTL_ONG_OFF (16)

/** \\brief  Length for Ifx_SBCU_DBCNTL_Bits.RA */
#define IFX_SBCU_DBCNTL_RA_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBCNTL_Bits.RA */
#define IFX_SBCU_DBCNTL_RA_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBCNTL_Bits.RA */
#define IFX_SBCU_DBCNTL_RA_OFF (4)

/** \\brief  Length for Ifx_SBCU_DBDAT_Bits.FPIDATA */
#define IFX_SBCU_DBDAT_FPIDATA_LEN (32)

/** \\brief  Mask for Ifx_SBCU_DBDAT_Bits.FPIDATA */
#define IFX_SBCU_DBDAT_FPIDATA_MSK (0xffffffff)

/** \\brief  Offset for Ifx_SBCU_DBDAT_Bits.FPIDATA */
#define IFX_SBCU_DBDAT_FPIDATA_OFF (0)

/** \\brief  Length for Ifx_SBCU_DBGNTT_Bits.CPU0 */
#define IFX_SBCU_DBGNTT_CPU0_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBGNTT_Bits.CPU0 */
#define IFX_SBCU_DBGNTT_CPU0_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBGNTT_Bits.CPU0 */
#define IFX_SBCU_DBGNTT_CPU0_OFF (8)

/** \\brief  Length for Ifx_SBCU_DBGNTT_Bits.CPU1 */
#define IFX_SBCU_DBGNTT_CPU1_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBGNTT_Bits.CPU1 */
#define IFX_SBCU_DBGNTT_CPU1_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBGNTT_Bits.CPU1 */
#define IFX_SBCU_DBGNTT_CPU1_OFF (9)

/** \\brief  Length for Ifx_SBCU_DBGNTT_Bits.DMA */
#define IFX_SBCU_DBGNTT_DMA_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBGNTT_Bits.DMA */
#define IFX_SBCU_DBGNTT_DMA_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBGNTT_Bits.DMA */
#define IFX_SBCU_DBGNTT_DMA_OFF (4)

/** \\brief  Length for Ifx_SBCU_DBGNTT_Bits.DMACHNR */
#define IFX_SBCU_DBGNTT_DMACHNR_LEN (8)

/** \\brief  Mask for Ifx_SBCU_DBGNTT_Bits.DMACHNR */
#define IFX_SBCU_DBGNTT_DMACHNR_MSK (0xff)

/** \\brief  Offset for Ifx_SBCU_DBGNTT_Bits.DMACHNR */
#define IFX_SBCU_DBGNTT_DMACHNR_OFF (24)

/** \\brief  Length for Ifx_SBCU_DBGNTT_Bits.ETH */
#define IFX_SBCU_DBGNTT_ETH_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBGNTT_Bits.ETH */
#define IFX_SBCU_DBGNTT_ETH_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBGNTT_Bits.ETH */
#define IFX_SBCU_DBGNTT_ETH_OFF (2)

/** \\brief  Length for Ifx_SBCU_DBGNTT_Bits.HSMCMI */
#define IFX_SBCU_DBGNTT_HSMCMI_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBGNTT_Bits.HSMCMI */
#define IFX_SBCU_DBGNTT_HSMCMI_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBGNTT_Bits.HSMCMI */
#define IFX_SBCU_DBGNTT_HSMCMI_OFF (13)

/** \\brief  Length for Ifx_SBCU_DBGNTT_Bits.HSMRMI */
#define IFX_SBCU_DBGNTT_HSMRMI_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBGNTT_Bits.HSMRMI */
#define IFX_SBCU_DBGNTT_HSMRMI_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBGNTT_Bits.HSMRMI */
#define IFX_SBCU_DBGNTT_HSMRMI_OFF (12)

/** \\brief  Length for Ifx_SBCU_DBGNTT_Bits.SDMACHNR */
#define IFX_SBCU_DBGNTT_SDMACHNR_LEN (8)

/** \\brief  Mask for Ifx_SBCU_DBGNTT_Bits.SDMACHNR */
#define IFX_SBCU_DBGNTT_SDMACHNR_MSK (0xff)

/** \\brief  Offset for Ifx_SBCU_DBGNTT_Bits.SDMACHNR */
#define IFX_SBCU_DBGNTT_SDMACHNR_OFF (16)

/** \\brief  Length for Ifx_SBCU_DBGNTT_Bits.SDMAH */
#define IFX_SBCU_DBGNTT_SDMAH_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBGNTT_Bits.SDMAH */
#define IFX_SBCU_DBGNTT_SDMAH_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBGNTT_Bits.SDMAH */
#define IFX_SBCU_DBGNTT_SDMAH_OFF (0)

/** \\brief  Length for Ifx_SBCU_DBGNTT_Bits.SDMAL */
#define IFX_SBCU_DBGNTT_SDMAL_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBGNTT_Bits.SDMAL */
#define IFX_SBCU_DBGNTT_SDMAL_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBGNTT_Bits.SDMAL */
#define IFX_SBCU_DBGNTT_SDMAL_OFF (15)

/** \\brief  Length for Ifx_SBCU_DBGNTT_Bits.SDMAM */
#define IFX_SBCU_DBGNTT_SDMAM_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBGNTT_Bits.SDMAM */
#define IFX_SBCU_DBGNTT_SDMAM_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBGNTT_Bits.SDMAM */
#define IFX_SBCU_DBGNTT_SDMAM_OFF (5)

/** \\brief  Length for Ifx_SBCU_DBGNTT_Bits.SFI */
#define IFX_SBCU_DBGNTT_SFI_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBGNTT_Bits.SFI */
#define IFX_SBCU_DBGNTT_SFI_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBGNTT_Bits.SFI */
#define IFX_SBCU_DBGNTT_SFI_OFF (10)

/** \\brief  Length for Ifx_SBCU_DBGRNT_Bits.CPU0 */
#define IFX_SBCU_DBGRNT_CPU0_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBGRNT_Bits.CPU0 */
#define IFX_SBCU_DBGRNT_CPU0_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBGRNT_Bits.CPU0 */
#define IFX_SBCU_DBGRNT_CPU0_OFF (8)

/** \\brief  Length for Ifx_SBCU_DBGRNT_Bits.CPU1 */
#define IFX_SBCU_DBGRNT_CPU1_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBGRNT_Bits.CPU1 */
#define IFX_SBCU_DBGRNT_CPU1_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBGRNT_Bits.CPU1 */
#define IFX_SBCU_DBGRNT_CPU1_OFF (9)

/** \\brief  Length for Ifx_SBCU_DBGRNT_Bits.DMA */
#define IFX_SBCU_DBGRNT_DMA_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBGRNT_Bits.DMA */
#define IFX_SBCU_DBGRNT_DMA_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBGRNT_Bits.DMA */
#define IFX_SBCU_DBGRNT_DMA_OFF (4)

/** \\brief  Length for Ifx_SBCU_DBGRNT_Bits.ETH */
#define IFX_SBCU_DBGRNT_ETH_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBGRNT_Bits.ETH */
#define IFX_SBCU_DBGRNT_ETH_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBGRNT_Bits.ETH */
#define IFX_SBCU_DBGRNT_ETH_OFF (2)

/** \\brief  Length for Ifx_SBCU_DBGRNT_Bits.HSMCMI */
#define IFX_SBCU_DBGRNT_HSMCMI_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBGRNT_Bits.HSMCMI */
#define IFX_SBCU_DBGRNT_HSMCMI_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBGRNT_Bits.HSMCMI */
#define IFX_SBCU_DBGRNT_HSMCMI_OFF (13)

