HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxSbcu_bf.h
/** \\brief  Length for Ifx_SBCU_PRIOH_Bits.SFI */
#define IFX_SBCU_PRIOH_SFI_LEN (4)

/** \\brief  Mask for Ifx_SBCU_PRIOH_Bits.SFI */
#define IFX_SBCU_PRIOH_SFI_MSK (0xf)

/** \\brief  Offset for Ifx_SBCU_PRIOH_Bits.SFI */
#define IFX_SBCU_PRIOH_SFI_OFF (8)

/** \\brief  Length for Ifx_SBCU_PRIOL_Bits.DMA */
#define IFX_SBCU_PRIOL_DMA_LEN (4)

/** \\brief  Mask for Ifx_SBCU_PRIOL_Bits.DMA */
#define IFX_SBCU_PRIOL_DMA_MSK (0xf)

/** \\brief  Offset for Ifx_SBCU_PRIOL_Bits.DMA */
#define IFX_SBCU_PRIOL_DMA_OFF (16)

/** \\brief  Length for Ifx_SBCU_PRIOL_Bits.ETH */
#define IFX_SBCU_PRIOL_ETH_LEN (4)

/** \\brief  Mask for Ifx_SBCU_PRIOL_Bits.ETH */
#define IFX_SBCU_PRIOL_ETH_MSK (0xf)

/** \\brief  Offset for Ifx_SBCU_PRIOL_Bits.ETH */
#define IFX_SBCU_PRIOL_ETH_OFF (8)

/** \\brief  Length for Ifx_SBCU_PRIOL_Bits.SDMAH */
#define IFX_SBCU_PRIOL_SDMAH_LEN (4)

/** \\brief  Mask for Ifx_SBCU_PRIOL_Bits.SDMAH */
#define IFX_SBCU_PRIOL_SDMAH_MSK (0xf)

/** \\brief  Offset for Ifx_SBCU_PRIOL_Bits.SDMAH */
#define IFX_SBCU_PRIOL_SDMAH_OFF (0)

/** \\brief  Length for Ifx_SBCU_PRIOL_Bits.SDMAM */
#define IFX_SBCU_PRIOL_SDMAM_LEN (4)

/** \\brief  Mask for Ifx_SBCU_PRIOL_Bits.SDMAM */
#define IFX_SBCU_PRIOL_SDMAM_MSK (0xf)

/** \\brief  Offset for Ifx_SBCU_PRIOL_Bits.SDMAM */
#define IFX_SBCU_PRIOL_SDMAM_OFF (20)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXSBCU_BF_H */
